app/Controllers/Autenticacion.php

INSERT INTO `user` (`full_name`, `last_name`, `email`, `password`) VALUES ('nahuel', 'Alvarez', 'sanjuafernandoalva@gmail.com', '$2y$10$bFmMesZTIsgS7x9LZO64q.7DqmM2nKwPSE/W6ziesDQ/dhc7/sVFW')
---
            ];

            $userModel = new \App\Models\UserModel();
            $query = $userModel->insert($values);